#@ # 
#@ # Running icc2_shell Version S-2021.06-SP4 for linux64 -- Nov 25, 2021
#@ # Date:   Tue Feb 11 19:37:17 2025
#@ # Run by: hwu6hc@gridley.ece.Virginia.EDU
#@ 

gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
set_app_var link_library ../ref/lib/db_nldm/saed14rvt_tt0p8v25c.db
create_lib johnson -technology ../ref/tech/NDM/saed14rvt_1p9m.tf -ref_libs ../ref/lib/NDM/saed14rvt_frame_only.ndm/
read_verilog ../source/johnson_compiled.v
link_block
win_set_filter -visible -class cell -filter {hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -visible -class pseudo_bump -filter {deleted}
win_set_filter -visible -class placement_blockage -filter {wiring} -layer {0-72}
win_set_filter -expand_cell_types {soft_macro  }
win_set_select_class -visible {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pin_blockage block_shielding topology_node topology_edge topology_repeater annotation_shape core_area die_area edit_group shape via terminal fill_cell placement_blockage }
win_set_filter -class cell -filter {array hard_macro_margin hard_margin route_blockage_margin soft_margin}
win_set_filter -class pseudo_bump -filter {deleted}
win_set_filter -class placement_blockage -filter {wiring} -layer {0-72}
win_set_select_class {cell port bound routing_blockage shaping_blockage pg_region bump_region pseudo_bump pin_blockage topology_node topology_edge topology_repeater annotation_shape edit_group shape via placement_blockage }
#set_app_var link_library ../ref/lib/db_nldm/saed14rvt_tt0p8v25c.db
#create_lib johnson -technology ../ref/tech/NDM/saed14rvt_1p9m.tf -ref_libs ../ref/lib/NDM/saed14rvt_frame_only.ndm/
#read_verilog ../source/johnson_compiled.v
set_attribute [get_layers M1] routing_direction horizontal
set_attribute [get_layers M1] routing_direction horizontal
set_attribute [get_layers M2] routing_direction horizontal
set_attribute [get_layers M3] routing_direction vertical
set_attribute [get_layers M4] routing_direction horizontal
set_attribute [get_layers M5] routing_direction vertical
set_attribute [get_layers M6] routing_direction horizontal
set_attribute [get_layers M7] routing_direction vertical
set_attribute [get_layers M8] routing_direction horizontal
set_attribute [get_layers M9] routing_direction vertical
set_attribute [get_layers MRDL] routing_direction horizontal
initialize_floorplan
remove_track -all
create_track -layer [get_layers M1] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -mask_pattern {mask_one mask_two} -coord 0
create_track -layer [get_layers M2] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -mask_pattern {mask_one mask_two} -coord 0
create_track -layer [get_layers M4] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers M6] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers M8] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers MRDL] -space 0.06 -width 0.034 -dir Y -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers M3] -space 0.074 -width 0.0340 -dir X -bbox {{{0.000 0.000} {3.552 3.000}}} -mask_pattern {mask_one mask_two} -coord 0
create_track -layer [get_layers M5] -space 0.074 -width 0.0340 -dir X -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers M7] -space 0.074 -width 0.0340 -dir X -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
create_track -layer [get_layers M9] -space 0.074 -width 0.0340 -dir X -bbox {{{0.000 0.000} {3.552 3.000}}} -coord 0
##//Power Ground Straps
source ../scripts/pg_core_straps.tcl
source ../scripts/mcmm.tcl
create_placement -floorplan
gui_zoom -window [gui_get_current_window -view] -full
legalize_placement
clock_opt
route_group -all_clock_nets -reuse_existing_global_route true -stop_after_global_route true

route_group -all_clock_nets -reuse_existing_global_route true -stop_after_global_route true
redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }

set_app_options -as_user_default -list {route.global.global_route_topology_style 1}
route_group -all_clock_nets -reuse_existing_global_route true
set_app_options -as_user_default -list {route.global.global_route_topology_style 0}


redirect $::sh_dev_null { set_app_options -name opt.internal.current_block_utilization -value [report_utilization] }




create_routing_rule _snps_autoNdr_power -spacings {M1 {0.040000} M2 {0.040000} M3 {0.040000} M4 {0.080000} M5 {0.080000} M6 {0.080000} M7 {0.080000} M8 {0.080000} M9 {0.080000} MRDL {4.000000} }  -spacing_weight_levels {M1 { medium } M2 { medium } M3 { medium } M4 { medium } M5 { medium } M6 { medium } M7 { medium } M8 { medium } M9 { medium } MRDL { medium } } -spacing_length_thresholds {M1 { 1.0 } M2 { 1.0 } M3 { 1.0 } M4 { 1.0 } M5 { 1.0 } M6 { 1.0 } M7 { 1.0 } M8 { 1.0 } M9 { 1.0 } MRDL { 1.0 } }
remove_routing_rules _snps_autoNdr_power
gui_zoom -window [gui_get_current_window -view] -factor 0.5
gui_zoom -window [gui_get_current_window -view] -factor 2.0
gui_zoom -window [gui_get_current_window -view] -factor 2.0
gui_zoom -window [gui_get_current_window -view] -factor 0.5
route_auto
add_redundant_vias
create_stdcell_fillers -lib_cells {*/SAEDRVT14_FILL16 */SAEDRVT14_FILL2 */SAEDRVT14_FILL3 */SAEDRVT14_FILL32 */SAEDRVT14_FILL4 */SAEDRVT14_FILL5 */SAEDRVT14_FILL64 */SAEDRVT14_FILL_ECO_1 */SAEDRVT14_FILL_ECO_12 */SAEDRVT14_FILL_ECO_18 */SAEDRVT14_FILL_ECO_2 */SAEDRVT14_FILL_ECO_3 */SAEDRVT14_FILL_ECO_6 */SAEDRVT14_FILL_ECO_9 */SAEDRVT14_FILL_NNWIV1Y2_2 */SAEDRVT14_FILL_NNWIV1Y2_3 */SAEDRVT14_FILL_NNWIY2_2 */SAEDRVT14_FILL_NNWIY2_3 */SAEDRVT14_FILL_NNWSPACERY2_7 */SAEDRVT14_FILL_NNWVDDBRKY2_3 */SAEDRVT14_FILLP2 */SAEDRVT14_FILLP3 */SAEDRVT14_FILL_SPACER_7 */SAEDRVT14_FILL_Y2_3}
route_auto
change_selection [get_nets all]
add_redundant_vias
check_legality
check_routes
check_pg_missing_vias
#puts "STARTING"
#puts "STARTING"
#puts "STARTING"
save_lib johnson
set_app_options -name signoff.check_drc.runset -value "../ref/tech/icv_drc/saed14nm_1p9m_drc_rules.rs"
signoff_check_drc
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {2.112 0.690}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {2.109 0.693}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.915 -0.447}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.771 -0.257}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.697 -0.155}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.591 -0.160}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.590 -0.105}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.590 -0.079}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.576 -0.068}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.576 -0.059}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {3.576 -0.056}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.573 -0.053}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.573 -0.055}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.572 -0.058}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.572 -0.064}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.570 -0.079}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.443 -0.134}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {3.398 -0.237}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.803 -0.207}
gui_zoom -window [gui_get_current_window -view] -full
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.311 0.959}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.534 0.982}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.536 0.981}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.371 0.639}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.369 0.642}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.440 0.453}
check_lvs -nets [get_nets] -checks {short open} -check_child_cells true -report_floating_pins true -open_reporting detailed > johnson.
write_parasitics -output ../results/johnson.spef -no_name_mapping -compress -hierarchical -rde_corr -format spef
write_verilog ../results/johnson_compiled.v -include all
set design johnson
set gdsout_map ../ref/tech/saed14nm_1p9m_gdsout_mw_icc2.map
set gds_files ../ref/tech/saed14_rvt.gds
write_gds -design $design -layer_map $gdsout_map -output_pin all -hierarchy all-keep_data_type -merge_files $gds_files -merge_gds_top_cell $design -units 2000-lib_cell_view frame-allow_design_mismatchjohnson_compiled.gds
save_lib johnson
set_app_options -name signoff.check_drc.runset -value "../ref/tech/icv_drc/saed14nm_1p9m_drc_rules.rs"
signoff_check_drc
signoff_check_drc
check_lvs -nets [get_nets] -checks {short open} -check_child_cells true -report_floating_pins true -open_reporting detailed > johnson.err
write_parasitics -output ../results/johnson.spef -no_name_mapping -compress -hierarchical -rde_corr -format spef
write_verilog ../results/johnson_compiled.v -include all
set design johnson
set gdsout_map ../ref/tech/saed14nm_1p9m_gdsout_mw_icc2.map
set gds_files ../ref/tech/saed14_rvt.gds
write_gds       -design $design                 -layer_map $gdsout_map          -output_pin all                 -hierarchy all          -keep_data_type                 -merge_files $gds_files         -merge_gds_top_cell $design             -units 2000             -lib_cell_view frame    -allow_design_mismatch  johnson_compiled.gds
write_verilog ../results/johnson_icc_compiled_nopg.v
read_verilog ../source/johnson_compiled.v
#read_verilog ../source/johnson_compiled.v
set_attribute [get_layers M1] routing_direction horizontal
set_attribute [get_layers M2] routing_direction horizontal
set_attribute [get_layers M3] routing_direction vertical
gui_show_man_page initialize_floorplan
set_attribute [get_layers M4] routing_direction horizontal
remove_pg_via_master_rules -all
remove_pg_patterns -all
remove_pg_strategies -all
remove_pg_strategy_via_rules -all
remove_pg_strategy_via_rules -all
create_net -ground VSS
create_net -power VDD
set_attribute -objects [get_nets VSS] -name net_type -value ground
set_attribute -objects [get_nets VDD] -name net_type -value power
connect_pg_net -net VSS [get_pins -physical_context */VSS]
connect_pg_net -net VDD [get_pins -physical_context */VDD]
create_pg_std_cell_conn_pattern m0_rail_color -layers {M1} -rail_width {@wtop @wbottom} -parameters {wtop wbottom} -rail_mask {mask_two mask_one}
set_pg_strategy m0_rail_strategy_pwr -core -pattern {{name: m0_rail_color} {nets: VDD} {parameters: {0.094 0.094}}}
set_pg_strategy m0_rail_strategy_gnd -core -pattern {{name: m0_rail_color} {nets: VSS} {parameters: {0.094 0.094}}}
#}
#{
set cpp 0.057
set rowh 0.240
set fix 0.001
################## V0 Vias
set M1_offst [expr $cpp*15];
set M1_offst_vdd 0.074;
set M1_offst_vss 0.148;
set M1_wdth 0.034;
set M1_stp [expr $cpp*30]
#set M1_stp 0.148
set M1_stp 0.74
create_pg_mesh_pattern m1_color2_mesh       -parameters {w1 s1 M1_stp f1}        -layers "       {{vertical_layer: M3} {width: @w1} {spacing: @s1} {pitch: $M1_stp} {offset: @f1} {mask: mask_two}}"
set_pg_strategy m1_color2_strategy_gnd -core -pattern "{name: m1_color2_mesh} {nets: VSS } {parameters: {$M1_wdth minimum M1_stp $M1_offst_vss}}" -extension {{stop: core_boundary}}
set_pg_strategy m1_color2_strategy_pwr -core -pattern "{name: m1_color2_mesh} {nets: VDD }   {parameters: {$M1_wdth minimum M1_stp $M1_offst_vdd}}" -extension {{stop: core_boundary}}
set_pg_via_master_rule vias -via_array_dimension {1 1}  -orient R90 -contact_code {VIA12BAR1_C} -track_alignment track -cut_mask mask_one
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.484 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.491 1.713}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 1.713}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 1.714}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.489 1.715}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.486 1.715}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.486 1.715}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.711 1.492}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.711 1.491}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.711 1.491}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.716 1.491}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.716 1.491}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.965 1.274}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.966 1.271}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.966 1.271}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.966 1.271}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.977 1.406}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.975 1.405}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.973 1.402}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.316 -0.601}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.314 -0.329}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.313 -0.192}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.313 -0.122}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.315 0.220}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.919 0.639}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {0.919 0.639}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 2 -at_point {1.038 0.399}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.043 0.454}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.051 0.498}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.051 0.498}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.490 0.289}
gui_zoom -window [gui_get_current_window -types Layout -mru] -factor 0.5 -at_point {1.503 0.284}
gui_zoom -window [gui_get_current_window -view] -full
